Meshes/square_hole/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          3876;
        startFace       2827;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       6703;
    }
    lowerWall
    {
        type            wall;
        physicalType    wall;
        nFaces          30;
        startFace       6733;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       6763;
    }
    upperWall
    {
        type            wall;
        physicalType    wall;
        nFaces          30;
        startFace       6793;
    }
    defaultFaces
    {
        type            empty;
        nFaces          40;
        startFace       6823;
    }
)

// ************************************************************************* //
